{"keras_version": "2.0.5", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 84, 84, 4], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "relu", "strides": [4, 4], "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [8, 8], "name": "conv2d_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 32, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "relu", "strides": [2, 2], "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_3", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"trainable": true, "activation": "relu", "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "units": 512, "kernel_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "use_bias": true, "activity_regularizer": null, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.003, "maxval": 0.003, "seed": null}}, "bias_constraint": null, "units": 3, "kernel_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}