{"config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 5, 1], "sparse": false, "name": "input_1"}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "reshape_1", "target_shape": [5], "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "units": 300, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "dropout_1", "rate": 0.6, "trainable": true}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "units": 300, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "units": 3, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "dense_3", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}}], "output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Model"}